src/main/java/ok/dht/test/yasevich/profiling/stage4/wrk/wrk-get-report5
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 1058.299ms, rate sampling interval: 3446ms
  Thread calibration: mean lat.: 1057.477ms, rate sampling interval: 3403ms
  Thread calibration: mean lat.: 1043.289ms, rate sampling interval: 3371ms
  Thread calibration: mean lat.: 1037.667ms, rate sampling interval: 3403ms
  Thread calibration: mean lat.: 1039.209ms, rate sampling interval: 3397ms
  Thread calibration: mean lat.: 1016.458ms, rate sampling interval: 3330ms
  Thread calibration: mean lat.: 1062.082ms, rate sampling interval: 3422ms
  Thread calibration: mean lat.: 1035.517ms, rate sampling interval: 3344ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.86s     2.34s   10.26s    57.90%
    Req/Sec     1.05k    10.21     1.07k    69.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.83s 
 75.000%    7.90s 
 90.000%    9.11s 
 99.000%    9.92s 
 99.900%   10.12s 
 99.990%   10.23s 
 99.999%   10.26s 
100.000%   10.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1615.871     0.000000            1         1.00
    2656.255     0.100000        41947         1.11
    3436.543     0.200000        83893         1.25
    4227.071     0.300000       125857         1.43
    5025.791     0.400000       167710         1.67
    5828.607     0.500000       209583         2.00
    6230.015     0.550000       230617         2.22
    6655.999     0.600000       251644         2.50
    7061.503     0.650000       272633         2.86
    7483.391     0.700000       293496         3.33
    7901.183     0.750000       314528         4.00
    8093.695     0.775000       324991         4.44
    8278.015     0.800000       335453         5.00
    8478.719     0.825000       346069         5.71
    8683.519     0.850000       356429         6.67
    8888.319     0.875000       366758         8.00
    8994.815     0.887500       372059         8.89
    9109.503     0.900000       377561        10.00
    9207.807     0.912500       382578        11.43
    9314.303     0.925000       387793        13.33
    9428.991     0.937500       393127        16.00
    9478.143     0.943750       395652        17.78
    9527.295     0.950000       398216        20.00
    9584.639     0.956250       400918        22.86
    9641.983     0.962500       403763        26.67
    9691.135     0.968750       406186        32.00
    9723.903     0.971875       407557        35.56
    9748.479     0.975000       408814        40.00
    9781.247     0.978125       410158        45.71
    9814.015     0.981250       411515        53.33
    9846.783     0.984375       412676        64.00
    9871.359     0.985938       413501        71.11
    9887.743     0.987500       414085        80.00
    9904.127     0.989062       414580        91.43
    9928.703     0.990625       415396       106.67
    9945.087     0.992188       415907       128.00
    9961.471     0.992969       416304       142.22
    9969.663     0.993750       416541       160.00
    9986.047     0.994531       416912       182.86
   10002.431     0.995313       417278       213.33
   10018.815     0.996094       417523       256.00
   10027.007     0.996484       417671       284.44
   10043.391     0.996875       417938       320.00
   10051.583     0.997266       418062       365.71
   10059.775     0.997656       418166       426.67
   10076.159     0.998047       418379       512.00
   10084.351     0.998242       418500       568.89
   10084.351     0.998437       418500       640.00
   10092.543     0.998633       418595       731.43
   10100.735     0.998828       418663       853.33
   10117.119     0.999023       418754      1024.00
   10125.311     0.999121       418805      1137.78
   10125.311     0.999219       418805      1280.00
   10141.695     0.999316       418862      1462.86
   10149.887     0.999414       418889      1706.67
   10166.271     0.999512       418937      2048.00
   10174.463     0.999561       418953      2275.56
   10182.655     0.999609       418968      2560.00
   10190.847     0.999658       419008      2925.71
   10190.847     0.999707       419008      3413.33
   10199.039     0.999756       419039      4096.00
   10199.039     0.999780       419039      4551.11
   10207.231     0.999805       419057      5120.00
   10215.423     0.999829       419071      5851.43
   10215.423     0.999854       419071      6826.67
   10223.615     0.999878       419086      8192.00
   10223.615     0.999890       419086      9102.22
   10231.807     0.999902       419099     10240.00
   10231.807     0.999915       419099     11702.86
   10239.999     0.999927       419111     13653.33
   10239.999     0.999939       419111     16384.00
   10239.999     0.999945       419111     18204.44
   10239.999     0.999951       419111     20480.00
   10256.383     0.999957       419119     23405.71
   10256.383     0.999963       419119     27306.67
   10256.383     0.999969       419119     32768.00
   10256.383     0.999973       419119     36408.89
   10264.575     0.999976       419126     40960.00
   10264.575     0.999979       419126     46811.43
   10264.575     0.999982       419126     54613.33
   10264.575     0.999985       419126     65536.00
   10264.575     0.999986       419126     72817.78
   10264.575     0.999988       419126     81920.00
   10264.575     0.999989       419126     93622.86
   10272.767     0.999991       419130    109226.67
   10272.767     1.000000       419130          inf
#[Mean    =     5855.947, StdDeviation   =     2336.989]
#[Max     =    10264.576, Total count    =       419130]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  500803 requests in 1.00m, 33.09MB read
  Non-2xx or 3xx responses: 249729
Requests/sec:   8346.73
Transfer/sec:    564.70KB