src/main/java/ok/dht/test/yasevich/profiling/stage4/wrk/wrk-put-report0
Running 30s test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 2.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.816ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.787ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.890ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.714ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.831ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.764ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.761ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07ms    3.39ms  73.79ms   93.43%
    Req/Sec     6.61k     1.41k   29.11k    88.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.89ms
 90.000%    3.66ms
 99.000%   17.97ms
 99.900%   36.99ms
 99.990%   59.30ms
 99.999%   71.55ms
100.000%   73.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.019     0.000000            1         1.00
       0.467     0.100000       100184         1.11
       0.686     0.200000       199940         1.25
       0.878     0.300000       299570         1.43
       1.062     0.400000       399235         1.67
       1.245     0.500000       499403         2.00
       1.342     0.550000       549339         2.22
       1.446     0.600000       599160         2.50
       1.564     0.650000       649061         2.86
       1.705     0.700000       698750         3.33
       1.885     0.750000       748496         4.00
       1.999     0.775000       773638         4.44
       2.139     0.800000       798552         5.00
       2.321     0.825000       823522         5.71
       2.579     0.850000       848372         6.67
       2.975     0.875000       873237         8.00
       3.275     0.887500       885760         8.89
       3.663     0.900000       898187        10.00
       4.167     0.912500       910673        11.43
       4.835     0.925000       923173        13.33
       5.711     0.937500       935645        16.00
       6.255     0.943750       941870        17.78
       6.907     0.950000       948084        20.00
       7.679     0.956250       954322        22.86
       8.615     0.962500       960562        26.67
       9.703     0.968750       966815        32.00
      10.359     0.971875       969955        35.56
      11.103     0.975000       973057        40.00
      11.959     0.978125       976183        45.71
      13.015     0.981250       979284        53.33
      14.335     0.984375       982391        64.00
      15.151     0.985938       983963        71.11
      16.063     0.987500       985514        80.00
      17.167     0.989062       987078        91.43
      18.511     0.990625       988627       106.67
      20.127     0.992188       990200       128.00
      21.087     0.992969       990969       142.22
      22.127     0.993750       991746       160.00
      23.327     0.994531       992525       182.86
      24.623     0.995313       993307       213.33
      26.111     0.996094       994089       256.00
      26.879     0.996484       994475       284.44
      27.759     0.996875       994866       320.00
      28.767     0.997266       995254       365.71
      29.887     0.997656       995643       426.67
      31.423     0.998047       996033       512.00
      32.335     0.998242       996229       568.89
      33.311     0.998437       996425       640.00
      34.399     0.998633       996622       731.43
      35.647     0.998828       996814       853.33
      37.183     0.999023       997009      1024.00
      38.399     0.999121       997105      1137.78
      39.967     0.999219       997205      1280.00
      41.375     0.999316       997300      1462.86
      42.815     0.999414       997399      1706.67
      44.351     0.999512       997495      2048.00
      45.439     0.999561       997545      2275.56
      46.591     0.999609       997595      2560.00
      48.159     0.999658       997642      2925.71
      49.855     0.999707       997691      3413.33
      52.639     0.999756       997739      4096.00
      53.599     0.999780       997763      4551.11
      54.559     0.999805       997788      5120.00
      55.263     0.999829       997812      5851.43
      56.223     0.999854       997836      6826.67
      57.375     0.999878       997861      8192.00
      58.111     0.999890       997873      9102.22
      59.615     0.999902       997885     10240.00
      61.535     0.999915       997897     11702.86
      62.975     0.999927       997909     13653.33
      65.279     0.999939       997923     16384.00
      66.623     0.999945       997928     18204.44
      67.327     0.999951       997934     20480.00
      68.223     0.999957       997940     23405.71
      68.863     0.999963       997947     27306.67
      69.183     0.999969       997952     32768.00
      69.439     0.999973       997956     36408.89
      70.015     0.999976       997958     40960.00
      70.207     0.999979       997961     46811.43
      71.039     0.999982       997966     54613.33
      71.103     0.999985       997967     65536.00
      71.295     0.999986       997969     72817.78
      71.359     0.999988       997970     81920.00
      71.551     0.999989       997972     93622.86
      71.743     0.999991       997973    109226.67
      71.999     0.999992       997975    131072.00
      72.191     0.999993       997976    145635.56
      72.191     0.999994       997976    163840.00
      72.319     0.999995       997977    187245.71
      72.767     0.999995       997980    218453.33
      72.767     0.999996       997980    262144.00
      72.767     0.999997       997980    291271.11
      72.767     0.999997       997980    327680.00
      72.767     0.999997       997980    374491.43
      72.767     0.999998       997980    436906.67
      73.343     0.999998       997981    524288.00
      73.343     0.999998       997981    582542.22
      73.343     0.999998       997981    655360.00
      73.343     0.999999       997981    748982.86
      73.343     0.999999       997981    873813.33
      73.855     0.999999       997982   1048576.00
      73.855     1.000000       997982          inf
#[Mean    =        2.068, StdDeviation   =        3.395]
#[Max     =       73.792, Total count    =       997982]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1499103 requests in 30.00s, 107.23MB read
  Non-2xx or 3xx responses: 999574
Requests/sec:  49969.84
Transfer/sec:      3.57MB